export const poolNameMc = {
  忌炎: "夜将寒色去",
  吟霖: "惊霆雨时节",
  今汐: "寒尽觉春生",
  长离: "炽羽策阵星",
  折枝: "赋彩作长吟",
  相里要: "千机逐星野",
  守岸人: "直至海水褪色",
  椿: "徘徊迷宫尽处",
  珂莱塔: "另一种喧嚣",
  洛可可: "箱中舞台",
  菲比: "于静谧呢喃",
  布兰特: "燃焰于海",
  坎特蕾拉: "映海之梦",
  赞妮: "行于光影之间",
  夏空: "诗与乐的交响",
  卡提希娅: "却也在风潮后轻舞",
  露帕: "胜利为我喝彩",
  弗洛洛: "挽歌永不落幕",
  奥古斯塔: "不坠烜冕",
  尤诺: "漫于盈缺时轴",
  嘉贝莉娜: "于灰烬中",
  仇远: "倦客不知身近远",
  千咲: "曙暮一线之间",
  琳奈: "非定义光谱",
  莫宁: "纵使星光于无穷远",
  爱弥斯: "飞星自春天启航",
  陆·赫斯: "逾此长冬",
  西格莉卡: "符文烁醒之刻",
  绯雪: "雪色所映千般未来",
  达妮娅: "予明日以谎言",
  丽贝卡: "怒 烬中重燃",
  露西: "梦 行于月畔",
  洛瑟菈: "显影于明日",
  秧秧·玄翎: "牵翎祈万声",
  穗穗: "斟雨祝荷风",
  清宵: "仙风玉影水天清",
  景燃: "身赴三途",
}

export const poolDetailMc = [
  {
    version: "1.0",
    half: "上半",
    from: "2024-05-23 10:00:00",
    to: "2024-06-13 09:59:59",
    char5: ["忌炎"],
    char4: ["丹瑾", "炽霞", "莫特斐"],
    weapon5: ["苍鳞千嶂"],
    weapon4: ["永夜长明", "奇幻变奏", "骇行"]
  }, {
    version: "1.0",
    half: "下半",
    from: "2024-06-06 10:00:00",
    to: "2024-06-26 11:59:59",
    char5: ["吟霖"],
    char4: ["桃祈", "秋水", "渊武"],
    weapon5: ["掣傀之手"],
    weapon4: ["今州守望", "华彩乐段", "西升"]
  }, {
    version: "1.1",
    half: "上半",
    from: "2024-06-28 12:00:00",
    to: "2024-07-22 09:59:59",
    char5: ["今汐"],
    char4: ["散华", "丹瑾", "秧秧"],
    weapon5: ["时和岁稔"],
    weapon4: ["异响空灵", "不归孤军", "袍泽之固"]
  }, {
    version: "1.1",
    half: "下半",
    from: "2024-07-22 10:00:00",
    to: "2024-08-14 11:59:59",
    char5: ["长离"],
    char4: ["桃祈", "白芷", "莫特斐"],
    weapon5: ["赫奕流明"],
    weapon4: ["异度", "行进序曲", "无眠烈火"]
  }, {
    version: "1.2",
    half: "上半",
    from: "2024-08-15 12:00:00",
    to: "2024-09-07 09:59:59",
    char5: ["折枝"],
    char4: ["炽霞", "白芷", "散华"],
    weapon5: ["琼枝冰绡"],
    weapon4: ["永夜长明", "今州守望", "骇行"]
  }, {
    version: "1.2",
    half: "下半",
    from: "2024-09-07 10:00:00",
    to: "2024-09-28 11:59:59",
    char5: ["相里要"],
    char4: ["丹瑾", "秋水", "渊武"],
    weapon5: ["诸方玄枢"],
    weapon4: ["呼啸重音", "东落", "飞逝"]
  }, {
    version: "1.3",
    half: "上半",
    from: "2024-09-29 05:00:00",
    to: "2024-10-24 09:59:59",
    char5: ["守岸人"],
    char4: ["桃祈", "秧秧", "炽霞"],
    weapon5: ["星序协响"],
    weapon4: ["永续坍缩", "异响空灵", "异度"]
  }, {
    version: "1.3",
    half: "下半",
    from: "2024-10-24 10:00:00",
    to: "2024-11-13 11:59:59",
    char5: ["忌炎"],
    char4: ["釉瑚", "散华", "莫特斐"],
    weapon5: ["苍鳞千嶂"],
    weapon4: ["尘云旋臂", "奇幻变奏", "东落"]
  }, {
    version: "1.4",
    half: "上半",
    from: "2024-11-14 04:00:00",
    to: "2024-12-12 09:59:59",
    char5: ["椿"],
    char4: ["丹瑾", "秧秧", "秋水"],
    weapon5: ["裁春"],
    weapon4: ["核熔星盘", "不归孤军", "飞逝"]
  }, {
    version: "1.4",
    half: "下半",
    from: "2024-12-12 10:00:00",
    to: "2025-01-01 11:59:59",
    char5: ["吟霖", "相里要"],
    char4: ["灯灯", "白芷", "渊武"],
    weapon5: ["掣傀之手", "诸方玄枢"],
    weapon4: ["凋亡频移", "今州守望", "骇行"]
  }, {
    version: "2.0",
    half: "上半",
    from: "2025-01-02 04:00:00",
    to: "2025-01-23 09:59:59",
    char5: ["珂莱塔", "折枝"],
    char4: ["散华", "炽霞", "莫特斐"],
    weapon5: ["死与舞", "琼枝冰绡"],
    weapon4: ["悖论喷流", "核熔星盘", "袍泽之固"]
  }, {
    version: "2.0",
    half: "下半",
    from: "2025-01-23 10:00:00",
    to: "2025-02-12 11:59:59",
    char5: ["洛可可", "今汐"],
    char4: ["丹瑾", "釉瑚", "渊武"],
    weapon5: ["悲喜剧", "时和岁稔"],
    weapon4: ["尘云旋臂", "永夜长明", "奇幻变奏"]
  }, {
    version: "2.1",
    half: "上半",
    from: "2025-02-13 04:00:00",
    to: "2025-03-06 09:59:59",
    char5: ["菲比"],
    char4: ["灯灯", "炽霞", "秋水"],
    weapon5: ["和光回唱"],
    weapon4: ["今州守望", "飞逝", "异响空灵"]
  }, {
    version: "2.1",
    half: "下半",
    from: "2025-03-06 10:00:00",
    to: "2025-03-26 11:59:59",
    char5: ["布兰特", "长离"],
    char4: ["釉瑚", "桃祈", "莫特斐"],
    weapon5: ["不灭航路", "赫奕流明"],
    weapon4: ["凋亡频移", "异度", "呼啸重音"]
  }, {
    version: "2.2",
    half: "上半",
    from: "2025-03-27 04:00:00",
    to: "2025-04-17 09:59:59",
    char5: ["坎特蕾拉", "椿"],
    char4: ["丹瑾", "炽霞", "渊武"],
    weapon5: ["海的呢喃", "裁春"],
    weapon4: ["核熔星盘", "西升", "华彩乐段"]
  }, {
    version: "2.2",
    half: "下半",
    from: "2025-04-17 10:00:00",
    to: "2025-04-28 11:59:59",
    char5: ["守岸人"],
    char4: ["白芷", "散华", "秋水"],
    weapon5: ["星序协响"],
    weapon4: ["永续坍缩", "异度", "无眠烈火"]
  }, {
    version: "2.3",
    half: "上半",
    from: "2025-04-29 04:00:00",
    to: "2025-05-22 09:59:59",
    char5: ["赞妮", "忌炎", "吟霖", "折枝", "相里要", "菲比"],
    char4: ["灯灯", "桃祈", "渊武"],
    weapon5: ["焰光裁定", "苍鳞千嶂", "掣傀之手", "琼枝冰绡", "诸方玄枢", "和光回唱"],
    weapon4: ["永夜长明", "行进序曲", "骇行"]
  }, {
    version: "2.3",
    half: "下半",
    from: "2025-05-22 10:00:00",
    to: "2025-06-11 11:59:59",
    char5: ["夏空", "今汐", "长离", "珂莱塔", "洛可可", "布兰特"],
    char4: ["丹瑾", "秧秧", "莫特斐"],
    weapon5: ["林间的咏叹调", "时和岁稔", "赫奕流明", "死与舞", "悲喜剧", "不灭航路"],
    weapon4: ["无眠烈火", "奇幻变奏", "悖论喷流"]
  }, {
    version: "2.4",
    half: "上半",
    from: "2025-06-12 04:00:00",
    to: "2025-07-03 09:59:59",
    char5: ["卡提希娅"],
    char4: ["秋水", "白芷", "釉瑚"],
    weapon5: ["不屈命定之冠"],
    weapon4: ["永续坍缩", "呼啸重音", "袍泽之固"]
  }, {
    version: "2.4",
    half: "下半",
    from: "2025-07-03 10:00:00",
    to: "2025-07-23 11:59:59",
    char5: ["露帕"],
    char4: ["散华", "桃祈", "炽霞"],
    weapon5: ["焰痕"],
    weapon4: ["东落", "不归孤军", "今州守望"]
  }, {
    version: "2.5",
    half: "上半",
    from: "2025-07-24 04:00:00",
    to: "2025-08-14 09:59:59",
    char5: ["弗洛洛", "洛可可"],
    char4: ["桃祈", "灯灯", "渊武"],
    weapon5: ["幽冥的忘忧章", "悲喜剧"],
    weapon4: ["今州守望", "尘云旋臂", "西升"]
  }, {
    version: "2.5",
    half: "下半",
    from: "2025-08-14 10:00:00",
    to: "2025-08-27 11:59:59",
    char5: ["坎特蕾拉", "布兰特"],
    char4: ["丹瑾", "莫特斐", "秧秧"],
    weapon5: ["海的呢喃", "不灭航路"],
    weapon4: ["行进序曲", "奇幻变奏", "飞逝"]
  }, {
    version: "2.6",
    half: "上半",
    from: "2025-08-28 04:00:00",
    to: "2025-09-17 09:59:59",
    char5: ["奥古斯塔", "珂莱塔", "守岸人"],
    char4: ["炽霞", "釉瑚", "渊武"],
    weapon5: ["驭冕铸雷之权", "死与舞", "星序协响"],
    weapon4: ["凋亡频移", "无眠烈火", "异度"]
  }, {
    version: "2.6",
    half: "下半",
    from: "2025-09-17 10:00:00",
    to: "2025-10-08 11:59:59",
    char5: ["尤诺", "夏空"],
    char4: ["秋水", "白芷", "桃祈"],
    weapon5: ["万物持存的注释", "林间的咏叹调"],
    weapon4: ["尘云旋臂", "悖论喷流", "核熔星盘"]
  }, {
    version: "2.7",
    half: "上半",
    from: "2025-10-09 04:00:00",
    to: "2025-10-30 09:59:59",
    char5: ["嘉贝莉娜", "露帕"],
    char4: ["散华", "莫特斐", "灯灯"],
    weapon5: ["光影双生", "焰痕"],
    weapon4: ["飞逝", "东落", "核熔星盘"]
  }, {
    version: "2.7",
    half: "下半",
    from: "2025-10-30 10:00:00",
    to: "2025-11-19 11:59:59",
    char5: ["仇远", "赞妮"],
    char4: ["秧秧", "桃祈", "丹瑾"],
    weapon5: ["裁竹", "焰光裁定"],
    weapon4: ["永续坍缩", "骇行", "永夜长明"]
  }, {
    version: "2.8",
    half: "上半",
    from: "2025-11-20 04:00:00",
    to: "2025-12-11 09:59:59",
    char5: ["千咲", "菲比"],
    char4: ["桃祈", "渊武", "秋水"],
    weapon5: ["昙切", "和光回唱"],
    weapon4: ["不归孤军", "核熔星盘", "东落"]
  }, {
    version: "2.8",
    half: "下半",
    from: "2025-12-11 10:00:00",
    to: "2025-12-24 11:59:59",
    char5: ["弗洛洛", "坎特蕾拉"],
    char4: ["卜灵", "丹瑾", "炽霞"],
    weapon5: ["幽冥的忘忧章", "海的呢喃"],
    weapon4: ["今州守望", "尘云旋臂", "西升"]
  }, {
    version: "3.0",
    half: "上半",
    from: "2025-12-25 04:00:00",
    to: "2026-01-15 09:59:59",
    char5: ["琳奈", "卡提希娅", "夏空"],
    char4: ["秧秧", "釉瑚", "白芷"],
    weapon5: ["溢彩荧辉", "不屈命定之冠", "林间的咏叹调"],
    weapon4: ["悖论喷流", "永续坍缩", "无眠烈火"]
  }, {
    version: "3.0",
    half: "下半",
    from: "2026-01-15 10:00:00",
    to: "2026-02-04 11:59:59",
    char5: ["莫宁", "奥古斯塔", "尤诺"],
    char4: ["炽霞", "散华", "丹瑾"],
    weapon5: ["宙算仪轨", "驭冕铸雷之权", "万物持存的注释"],
    weapon4: ["异响空灵", "凋亡频移", "尘云旋臂"]
  }, {
    version: "3.1",
    half: "上半",
    from: "2026-02-05 04:00:00",
    to: "2026-02-26 09:59:59",
    char5: ["爱弥斯", "千咲", "露帕"],
    char4: ["莫特斐", "桃祈", "秋水"],
    weapon5: ["永远的启明星", "昙切", "焰痕"],
    weapon4: ["悖论喷流", "永续坍缩", "无眠烈火"]
  }, {
    version: "3.1",
    half: "下半",
    from: "2026-02-26 10:00:00",
    to: "2026-03-18 11:59:59",
    char5: ["陆·赫斯", "嘉贝莉娜"],
    char4: ["散华", "灯灯", "渊武"],
    weapon5: ["白昼之脊", "光影双生"],
    weapon4: ["异响空灵", "凋亡频移", "尘云旋臂"]
  }, {
    version: "3.2",
    half: "上半",
    from: "2026-03-19 04:00:00",
    to: "2026-04-09 09:59:59",
    char5: ["西格莉卡", "仇远"],
    char4: ["散华", "卜灵", "秧秧"],
    weapon5: ["昭日译注", "裁竹"],
    weapon4: ["尘云旋臂", "永续坍缩", "西升"]
  }, {
    version: "3.2",
    half: "下半",
    from: "2026-04-09 10:00:00",
    to: "2026-04-29 11:59:59",
    char5: ["菲比", "琳奈", "赞妮"],
    char4: ["桃祈", "釉瑚", "丹瑾"],
    weapon5: ["和光回唱", "溢彩荧辉", "焰光裁定"],
    weapon4: ["悖论喷流", "呼啸重音", "奇幻变奏"]
  }, {
    version: "3.3",
    half: "上半",
    from: "2026-04-30 04:00:00",
    to: "2026-05-21 09:59:59",
    char5: ["绯雪", "莫宁", "尤诺"],
    char4: ["白芷", "秋水", "渊武"],
    weapon5: ["灼霜", "宙算仪轨", "万物持存的注释"],
    weapon4: ["不归孤军", "异响空灵", "无眠烈火"]
  }, {
    version: "3.3",
    half: "下半",
    from: "2026-05-21 10:00:00",
    to: "2026-06-07 11:59:59",
    char5: ["达妮娅", "千咲", "弗洛洛"],
    char4: ["炽霞", "卜灵", "秧秧"],
    weapon5: ["赝作的矮星", "昙切", "幽冥的忘忧章"],
    weapon4: ["核熔星盘", "凋亡频移", "飞逝"]
  }, {
    version: "3.4",
    half: "第一阶段",
    from: "2026-06-08 04:00:00",
    to: "2026-07-09 11:59:59",
    char5: ["丽贝卡", "露西"],
    char4: ["灯灯", "釉瑚", "桃祈"],
    weapon5: ["碎骨", "蜃影"],
    weapon4: ["悖论喷流", "华彩乐段", "核熔星盘"]
  }, {
    version: "3.4",
    half: "第二阶段",
    from: "2026-06-13 10:00:00",
    to: "2026-07-09 11:59:59",
    char5: ["洛瑟菈"],
    char4: ["灯灯", "釉瑚", "桃祈"],
    weapon5: ["存帧"],
    weapon4: ["悖论喷流", "华彩乐段", "核熔星盘"]
  }, {
    version: "3.4",
    half: "第三阶段",
    from: "2026-06-18 10:00:00",
    to: "2026-07-09 11:59:59",
    char5: ["卡提希娅"],
    char4: ["秧秧", "渊武", "莫特斐"],
    weapon5: ["不屈命定之冠"],
    weapon4: ["永续坍缩", "呼啸重音", "袍泽之固"]
  }, {
    version: "3.5",
    half: "上半",
    from: "2026-07-10 04:00:00",
    to: "2026-07-30 09:59:59",
    char5: ["秧秧·玄翎", "陆·赫斯", "琳奈"],
    char4: ["丹瑾", "炽霞", "秋水"],
    weapon5: ["天之苍苍", "白昼之脊", "溢彩荧辉"],
    weapon4: ["不归孤军", "骇行", "异响空灵"]
  }, {
    version: "3.5",
    half: "全程",
    from: "2026-07-10 04:00:00",
    to: "2026-08-19 11:59:59",
    char5: ["忌炎", "吟霖", "今汐", "长离", "折枝", "相里要"],
    char4: ["卜灵", "散华", "秧秧"],
    weapon5: ["苍鳞千嶂", "掣傀之手", "时和岁稔", "赫奕流明", "琼枝冰绡", "诸方玄枢"],
    weapon4: ["永夜长明", "奇幻变奏", "永续坍缩"]
  }, {
    version: "3.5",
    half: "下半",
    from: "2026-07-30 10:00:00",
    to: "2026-08-19 11:59:59",
    char5: ["爱弥斯", "穗穗"],
    char4: ["白芷", "莫特斐", "灯灯"],
    weapon5: ["永远的启明星", "栖霞饮露"],
    weapon4: ["奇幻变奏", "永续坍缩", "悖论喷流"]
  }, {
    version: "3.6",
    half: "上半",
    from: "2026-08-20 04:00:00",
    to: "2026-09-10 09:59:59",
    char5: ["清宵", "达妮娅"],
    char4: ["秧秧", "散华", "白芷"],
    weapon5: ["云琅", "赝作的矮星"],
    weapon4: ["不归孤军", "核熔星盘", "西升"]
  }, {
    version: "3.6",
    half: "下半",
    from: "2026-09-10 10:00:00",
    to: "2026-09-29 11:59:59",
    char5: ["景燃", "绯雪", "莫宁"],
    char4: ["渊武", "莫特斐", "秋水"],
    weapon5: ["千般渡", "灼霜", "宙算仪轨"],
    weapon4: ["凋亡频移", "异响空灵", "飞逝"]
  }
]
